Documents/ХранилищеИсторииЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ХранилищеИсторииЧатов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ХранилищеИсторииЧатов</xr:Item>
				<xr:Item>InformationRegister.ЧатСессииСКлиентом</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаСохранения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиСохраненияИсторииЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Отправители</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мессенджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАкаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ХранилищеИсторииЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеИсторииЧатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаСохранения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиСохраненияИсторииЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяАкаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Отправители</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мессенджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ХранилищеИсторииЧатов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция Создать() Экспорт

	Элемент = СоздатьДокумент()
		.НастройкиПоУмолчанию()
		.НастройкаСохранения(
			Константы.НастройкаИсторииЧатовПоУмолчанию.Получить());
	
	Возврат Элемент;

КонецФункции // ()

Процедура Сохранить(Сообщение) Экспорт

	Создать()
		.Сообщение(Сообщение)
		.Сохранить();

КонецПроцедуры

Процедура ДобавитьОтправителя(Хранитель, КлиентДляЗаполнения) Экспорт

	Хранитель.ПолучитьОбъект()
		.Клиент(КлиентДляЗаполнения)
		.Перезаписать();

КонецПроцедуры

Функция ПолучитьНеопознаных(Мессенджер, НастройкаСохранения) Экспорт

	МодульХранения = УправлениеМетаданными
		.МенеджерОбъектаПоСсылке(НастройкаСохранения);
	
	КаталогСообщения = НастройкаСохранения.ХранилищеФайлов;
	
	Возврат МодульХранения.ПолучитьНеопознаных(КаталогСообщения, Мессенджер);
	
КонецФункции // ()

Функция ПолучитьИсториюЗаДень(Клиент, ДеньЗагрузки = Неопределено, Количество = Неопределено) Экспорт

	Хранитель = РегистрыСведений.ХранилищеИсторииЧатов;
	
	Если ДеньЗагрузки = Неопределено Тогда
	
		ДеньЗагрузки = ТекущаяДатаСеанса();
	
	КонецЕсли;
	
	Фильтр = Хранитель.НовыйФильтр();
	Фильтр.Вставить("НачалоПериода", НачалоДня(ДеньЗагрузки));
	Фильтр.Вставить("КонецПериода", КонецДня(ДеньЗагрузки));
	Фильтр.Вставить("Количество", Количество);
	
	Возврат ПолучитьИсториюПоФильтру(Хранитель, Клиент, Фильтр);

КонецФункции // ()

Функция ПолучитьИсториюЗаПериод(Клиент, НачалоЗагрузки, КонецЗагрузки, Количество = Неопределено) Экспорт

	Хранитель = РегистрыСведений.ХранилищеИсторииЧатов;
	
	Фильтр = Хранитель.НовыйФильтр();
	Фильтр.Вставить("НачалоПериода", НачалоДня(НачалоЗагрузки));
	Фильтр.Вставить("КонецПериода", КонецДня(КонецЗагрузки));
	Фильтр.Вставить("Количество", Количество);
	
	Возврат ПолучитьИсториюПоФильтру(Хранитель, Клиент, Фильтр);

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИсториюПоФильтру(Хранитель, Клиент, Фильтр)

	Записи = Хранитель.История(Клиент, Фильтр);
	
	Если ЗначениеЗаполнено(Записи) Тогда
	
		Записи.Сортировать("Дата");
	
	КонецЕсли;
	
	История = СообщениеИзЧата.НоваяИстория();
	
	Для каждого Запись Из Записи Цикл
	
		Настройка = Запись.НастройкаСохранения;
		ДанныеСообщения = Настройка.ПолучитьОбъект()
			.ПолучитьДанныеСообщения(
				Запись.Мессенджер,
				УправлениеМетаданными.МенеджерОбъектаПоСсылке(Клиент)
					.ВладелецМесенджера(Клиент),
				Запись.Дата);
		
		СообщениеИзЧата.ДобавитьСообщение(История, ДанныеСообщения);
	
	КонецЦикла;
	
	Возврат История;

КонецФункции // ()

Процедура ДобавитьЗаписи(Приемник, Источник)

	Для каждого ДобавляемаяЗаипсь Из Источник Цикл
	
		Запись = Приемник.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ДобавляемаяЗаипсь);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
